print('对话小游戏\n')
print('1.开始游戏')
print('2.退出')
num = input('输入序号：')
num = int(num)
names = ['鸢一折纸','伊卡洛斯']
if num == 1:
	print('你好~,能告诉我你的名字吗？')
	name = input('你的名字：')
	print(name,'你就叫这个名字~，很好听呢~')
	print('那我的名字是：1 or 2')
	print(names)
	ber = input('输入序号：')
	ber = int(ber)
	if ber == 1:
		print(names[0])
		print('我是',names[0],'很高兴能和你对话')
		print('----------------------------------')
		print('----------------------------------')
		print('----------------------------------')
		print('----------------------------------')
		print('早~~~，哦哈哟~~')
		tell = input();
	elif ber == 2:
		print(names[1])
		print('我是',names[1],'很高兴能和你对话')
		print('----------------------------------')
		print('----------------------------------')
		print('----------------------------------')
		print('----------------------------------')
	else:
		print('没有此选项')
